In [3]:
import numpy as np
import pandas as pd

In [4]:
train=pd.read_csv("q:/train.csv")
test=pd.read_csv("q:/test.csv")
train.shape

(891, 12)

In [5]:
test.shape

(418, 11)

In [6]:
full=train.append(test,ignore_index=True)
full.shape

C:\Users\ASUS\AppData\Local\Temp\ipykernel_17940\3841737661.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  full=train.append(test,ignore_index=True)

(1309, 12)

In [7]:
full.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
full.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,1309.000000,891.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,0.383838,2.294882,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.486592,0.837836,14.413493,1.041658,0.865560,51.758668
min,1.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,3.000000,80.000000,8.000000,9.000000,512.329200

In [9]:
full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 122.8+ KB

In [10]:
full['Age']=full['Age'].fillna(full['Age'].mean())
full['Fare']=full['Fare'].fillna(full['Fare'].mean())

In [11]:
full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1309 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1309 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 122.8+ KB

In [12]:
full['Embarked'].head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object

In [13]:
full['Embarked'].value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

In [14]:
full['Embarked']=full['Embarked'].fillna('S')
full['Embarked'].value_counts()

S    916
C    270
Q    123
Name: Embarked, dtype: int64

In [15]:
full['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [16]:
full['Cabin']=full['Cabin'].fillna('U')

In [17]:
full['Cabin'].head()

0       U
1     C85
2       U
3    C123
4       U
Name: Cabin, dtype: object

In [18]:
full.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,U,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,U,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,U,S

In [19]:
full.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1309 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1309 non-null   float64
 10  Cabin        1309 non-null   object
 11  Embarked     1309 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 122.8+ KB

In [20]:
full['Sex'].head()

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [22]:
sex_mapDict={'male':1,'female':0}
full['Sex']=full['Sex'].map(sex_mapDict)

In [23]:
full.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",NaN,22.0,1,0,A/5 21171,7.2500,U,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",NaN,26.0,0,0,STON/O2. 3101282,7.9250,U,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",NaN,35.0,0,0,373450,8.0500,U,S

In [24]:
full['Embarked'].head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object

In [25]:
Embarked=pd.DataFrame()
embarkedDF=pd.get_dummies(full['Embarked'],prefix='Embarked')
embarkedDF.head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [26]:
full=pd.concat([full,embarkedDF],axis=1)
full.drop('Embarked',axis=1,inplace=True)
full.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked_C,Embarked_Q,Embarked_S
0,1,0.0,3,"Braund, Mr. Owen Harris",NaN,22.0,1,0,A/5 21171,7.2500,U,0,0,1
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38.0,1,0,PC 17599,71.2833,C85,1,0,0
2,3,1.0,3,"Heikkinen, Miss. Laina",NaN,26.0,0,0,STON/O2. 3101282,7.9250,U,0,0,1
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,35.0,1,0,113803,53.1000,C123,0,0,1
4,5,0.0,3,"Allen, Mr. William Henry",NaN,35.0,0,0,373450,8.0500,U,0,0,1

In [27]:
pclassDf=pd.DataFrame()
pclassDf=pd.get_dummies(full['Pclass'],prefix='Pclass')
pclassDf.head()

   Pclass_1  Pclass_2  Pclass_3
0         0         0         1
1         1         0         0
2         0         0         1
3         1         0         0
4         0         0         1

In [28]:
full=pd.concat([full,pclassDf],axis=1)
full.drop('Pclass',axis=1,inplace=True)
full.head()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3
0,1,0.0,"Braund, Mr. Owen Harris",NaN,22.0,1,0,A/5 21171,7.2500,U,0,0,1,0,0,1
1,2,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",NaN,38.0,1,0,PC 17599,71.2833,C85,1,0,0,1,0,0
2,3,1.0,"Heikkinen, Miss. Laina",NaN,26.0,0,0,STON/O2. 3101282,7.9250,U,0,0,1,0,0,1
3,4,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",NaN,35.0,1,0,113803,53.1000,C123,0,0,1,1,0,0
4,5,0.0,"Allen, Mr. William Henry",NaN,35.0,0,0,373450,8.0500,U,0,0,1,0,0,1

In [29]:
full['Name'].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [30]:
def getTitle(Name):
    str1=Name.split(',')[1]
    str2=str1.split('.')[0]
    str3=str2.strip()
    return str3
titleDf=pd.DataFrame()
titleDf['Title']=full['Name'].map(getTitle)
titleDf.head()

  Title
0    Mr
1   Mrs
2  Miss
3   Mrs
4    Mr

In [31]:
titleDf.head(20)

     Title
0       Mr
1      Mrs
2     Miss
3      Mrs
4       Mr
5       Mr
6       Mr
7   Master
8      Mrs
9      Mrs
10    Miss
11    Miss
12      Mr
13      Mr
14    Miss
15     Mrs
16  Master
17      Mr
18     Mrs
19     Mrs

In [32]:
title_mapDict={
    'Capt':'Officer', 
    'Col':'Officer', 
    'Major':'Officer', 
    'Jonkheer':'Royalty',  
    'Dona':'Royalty', 
    'Sir':'Royalty',  
    'Dr':'Officer',  
    'Rev':'Officer', 
    'the Countess':'Royalty',  
    'Mme':'Mrs', 
    'Mlle':'Miss', 
    'Ms':'Mrs',  
    'Mr':'Mr', 
    'Mrs':'Mrs', 
    'Miss':'Miss', 
    'Master':'Master', 
    'Lady':'Royalty'
}
titleDf['Title']=titleDf['Title'].map(title_mapDict)
titleDf=pd.get_dummies(titleDf['Title'])
titleDf.head()

   Master  Miss  Mr  Mrs  Officer  Royalty
0       0     0   1    0        0        0
1       0     0   0    1        0        0
2       0     1   0    0        0        0
3       0     0   0    1        0        0
4       0     0   1    0        0        0

In [33]:
full=pd.concat([full,titleDf],axis=1)
full.drop('Name',axis=1,inplace=True)
full.head()

,PassengerId,Survived,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked_C,...,Embarked_S,Pclass_1,Pclass_2,Pclass_3,Master,Miss,Mr,Mrs,Officer,Royalty
0,1,0.0,NaN,22.0,1,0,A/5 21171,7.2500,U,0,...,1,0,0,1,0,0,1,0,0,0
1,2,1.0,NaN,38.0,1,0,PC 17599,71.2833,C85,1,...,0,1,0,0,0,0,0,1,0,0
2,3,1.0,NaN,26.0,0,0,STON/O2. 3101282,7.9250,U,0,...,1,0,0,1,0,1,0,0,0,0
3,4,1.0,NaN,35.0,1,0,113803,53.1000,C123,0,...,1,1,0,0,0,0,0,1,0,0
4,5,0.0,NaN,35.0,0,0,373450,8.0500,U,0,...,1,0,0,1,0,0,1,0,0,0

In [34]:
full['Cabin'].head()

0       U
1     C85
2       U
3    C123
4       U
Name: Cabin, dtype: object

In [35]:
cabinDf=pd.DataFrame()
full['Cabin']=full['Cabin'].map(lambda c:c[0])
cabinDf=pd.get_dummies(full['Cabin'],prefix='Cabin')
cabinDf.head()

,Cabin_A,Cabin_B,Cabin_C,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U
0,0,0,0,0,0,0,0,0,1
1,0,0,1,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,1
3,0,0,1,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,1

In [36]:
full=pd.concat([full,cabinDf],axis=1)
full.drop('Cabin',axis=1,inplace=True)
full.head()

,PassengerId,Survived,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked_C,Embarked_Q,...,Royalty,Cabin_A,Cabin_B,Cabin_C,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U
0,1,0.0,NaN,22.0,1,0,A/5 21171,7.2500,0,0,...,0,0,0,0,0,0,0,0,0,1
1,2,1.0,NaN,38.0,1,0,PC 17599,71.2833,1,0,...,0,0,0,1,0,0,0,0,0,0
2,3,1.0,NaN,26.0,0,0,STON/O2. 3101282,7.9250,0,0,...,0,0,0,0,0,0,0,0,0,1
3,4,1.0,NaN,35.0,1,0,113803,53.1000,0,0,...,0,0,0,1,0,0,0,0,0,0
4,5,0.0,NaN,35.0,0,0,373450,8.0500,0,0,...,0,0,0,0,0,0,0,0,0,1

In [37]:
familyDf=pd.DataFrame()
familyDf['FamilySize']=full['Parch']+full['SibSp']+1
familyDf['family_Single']=familyDf['FamilySize'].map(lambda s:1 if s==1 else 0)
familyDf['family_Small']=familyDf['FamilySize'].map(lambda s:1 if 2<=s<=4 else 0)
familyDf['family_Large']=familyDf['FamilySize'].map(lambda s:1 if s>=5 else 0)
familyDf.head()

   FamilySize  family_Single  family_Small  family_Large
0           2              0             1             0
1           2              0             1             0
2           1              1             0             0
3           2              0             1             0
4           1              1             0             0

In [38]:
full=pd.concat([full,familyDf],axis=1)
full.head()

,PassengerId,Survived,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked_C,Embarked_Q,...,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U,FamilySize,family_Single,family_Small,family_Large
0,1,0.0,NaN,22.0,1,0,A/5 21171,7.2500,0,0,...,0,0,0,0,0,1,2,0,1,0
1,2,1.0,NaN,38.0,1,0,PC 17599,71.2833,1,0,...,0,0,0,0,0,0,2,0,1,0
2,3,1.0,NaN,26.0,0,0,STON/O2. 3101282,7.9250,0,0,...,0,0,0,0,0,1,1,1,0,0
3,4,1.0,NaN,35.0,1,0,113803,53.1000,0,0,...,0,0,0,0,0,0,2,0,1,0
4,5,0.0,NaN,35.0,0,0,373450,8.0500,0,0,...,0,0,0,0,0,1,1,1,0,0

In [47]:
full.shape

(1309, 33)

In [48]:
corrDf=full.corr()
corrDf

,PassengerId,Survived,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,...,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U,FamilySize,family_Single,family_Small,family_Large
PassengerId,1.000000,-0.005007,NaN,0.025731,-0.055224,0.008942,0.031416,0.048101,0.011585,-0.049836,...,0.000549,-0.008136,0.000306,-0.045949,-0.023049,0.000208,-0.031437,0.028546,0.002975,-0.063415
Survived,-0.005007,1.000000,NaN,-0.070323,-0.035322,0.081629,0.257307,0.168240,0.003650,-0.149683,...,0.150716,0.145321,0.057935,0.016040,-0.026456,-0.316912,0.016639,-0.203367,0.279855,-0.125147
Sex,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,0.025731,-0.070323,NaN,1.000000,-0.190747,-0.130872,0.171521,0.076179,-0.012718,-0.059153,...,0.132886,0.106600,-0.072644,-0.085977,0.032461,-0.271918,-0.196996,0.116675,-0.038189,-0.161210
SibSp,-0.055224,-0.035322,NaN,-0.190747,1.000000,0.373587,0.160224,-0.048396,-0.048678,0.073709,...,-0.015727,-0.027180,-0.008619,0.006015,-0.013247,0.009064,0.861952,-0.591077,0.253590,0.699681
Parch,0.008942,0.081629,NaN,-0.130872,0.373587,1.000000,0.221522,-0.008635,-0.100943,0.071881,...,-0.027385,0.001084,0.020481,0.058325,-0.012304,-0.036806,0.792296,-0.549022,0.248532,0.624627
Fare,0.031416,0.257307,NaN,0.171521,0.160224,0.221522,1.000000,0.286241,-0.130054,-0.169894,...,0.072737,0.073949,-0.037567,-0.022857,0.001179,-0.507197,0.226465,-0.274826,0.197281,0.170853
Embarked_C,0.048101,0.168240,NaN,0.076179,-0.048396,-0.008635,0.286241,1.000000,-0.164166,-0.778262,...,0.107782,0.027566,-0.020010,-0.031566,-0.014095,-0.258257,-0.036553,-0.107874,0.159594,-0.092825
Embarked_Q,0.011585,0.003650,NaN,-0.012718,-0.048678,-0.100943,-0.130054,-0.164166,1.000000,-0.491656,...,-0.061459,-0.042877,-0.020282,-0.019941,-0.008904,0.142369,-0.087190,0.127214,-0.122491,-0.018423
Embarked_S,-0.049836,-0.149683,NaN,-0.059153,0.073709,0.071881,-0.169894,-0.778262,-0.491656,1.000000,...,-0.056023,0.002960,0.030575,0.040560,0.018111,0.137351,0.087771,0.014246,-0.062909,0.093671
Pclass_1,0.026495,0.285904,NaN,0.362587,-0.034256,-0.013033,0.599956,0.325722,-0.166101,-0.181800,...,0.275698,0.242963,-0.073083,-0.035441,0.048310,-0.776987,-0.029656,-0.126551,0.165965,-0.067523
Pclass_2,0.022714,0.093349,NaN,-0.014193,-0.052419,-0.010057,-0.121372,-0.134675,-0.121973,0.196532,...,-0.037929,-0.050210,0.127371,-0.032081,-0.014325,0.176485,-0.039976,-0.035075,0.097270,-0.118495
Pclass_3,-0.041544,-0.322308,NaN,-0.302093,0.072610,0.019521,-0.419616,-0.171430,0.243706,-0.003805,...,-0.207455,-0.169063,-0.041178,0.056964,-0.030057,0.527614,0.058430,0.138250,-0.223338,0.155560
Master,0.002254,0.085221,NaN,-0.363923,0.329171,0.253482,0.011596,-0.014172,-0.009091,0.018297,...,-0.042192,0.001860,0.058311,-0.013690,-0.006113,0.041178,0.355061,-0.265355,0.120166,0.301809
Miss,-0.050027,0.332795,NaN,-0.254146,0.077564,0.066473,0.092051,-0.014351,0.198804,-0.113886,...,-0.012516,0.008700,-0.003088,0.061881,-0.013832,-0.004364,0.087350,-0.023890,-0.018085,0.083422
Mr,0.014116,-0.549199,NaN,0.165476,-0.243104,-0.304780,-0.192192,-0.065538,-0.080224,0.108924,...,-0.030261,-0.032953,-0.026403,-0.072514,0.023611,0.131807,-0.326487,0.386262,-0.300872,-0.194207
Mrs,0.033299,0.344935,NaN,0.198091,0.061643,0.213491,0.139235,0.098379,-0.100374,-0.022950,...,0.080393,0.045538,0.013376,0.042547,-0.011742,-0.162253,0.157233,-0.354649,0.361247,0.012893
Officer,0.002231,-0.031316,NaN,0.162818,-0.013813,-0.032631,0.028696,0.003678,-0.003212,-0.001202,...,0.006055,-0.024048,-0.017076,-0.008281,-0.003698,-0.067030,-0.026921,0.013303,0.003966,-0.034572
Royalty,0.025269,0.050561,NaN,0.055386,-0.005879,-0.027555,0.030040,0.060256,-0.019941,-0.040498,...,-0.011817,-0.011135,-0.007907,-0.003834,-0.001712,-0.085163,-0.018928,-0.000445,0.008687,-0.016008
Cabin_A,-0.002831,0.022287,NaN,0.125177,-0.039808,-0.030707,0.020094,0.094914,-0.042105,-0.056984,...,-0.024952,-0.023510,-0.016695,-0.008096,-0.003615,-0.242399,-0.042967,0.045227,-0.029546,-0.033799
Cabin_B,0.015895,0.175095,NaN,0.113458,-0.011569,0.073051,0.393743,0.161595,-0.073613,-0.095790,...,-0.043624,-0.041103,-0.029188,-0.014154,-0.006320,-0.423794,0.032318,-0.087912,0.084268,0.013470
Cabin_C,0.006092,0.114652,NaN,0.167993,0.048616,0.009601,0.401370,0.158043,-0.059151,-0.101861,...,-0.053083,-0.050016,-0.035516,-0.017224,-0.007691,-0.515684,0.037226,-0.137498,0.141925,0.001362
Cabin_D,0.000549,0.150716,NaN,0.132886,-0.015727,-0.027385,0.072737,0.107782,-0.061459,-0.056023,...,1.000000,-0.034317,-0.024369,-0.011817,-0.005277,-0.353822,-0.025313,-0.074310,0.102432,-0.049336
Cabin_E,-0.008136,0.145321,NaN,0.106600,-0.027180,0.001084,0.073949,0.027566,-0.042877,0.002960,...,-0.034317,1.000000,-0.022961,-0.011135,-0.004972,-0.333381,-0.017285,-0.042535,0.068007,-0.046485
Cabin_F,0.000306,0.057935,NaN,-0.072644,-0.008619,0.020481,-0.037567,-0.020010,-0.020282,0.030575,...,-0.024369,-0.022961,1.000000,-0.007907,-0.003531,-0.236733,0.005525,0.004055,0.012756,-0.033009
Cabin_G,-0.045949,0.016040,NaN,-0.085977,0.006015,0.058325,-0.022857,-0.031566,-0.019941,0.040560,...,-0.011817,-0.011135,-0.007907,1.000000,-0.001712,-0.114803,0.035835,-0.076397,0.087471,-0.016008
Cabin_T,-0.023049,-0.026456,NaN,0.032461,-0.013247,-0.012304,0.001179,-0.014095,-0.008904,0.018111,...,-0.005277,-0.004972,-0.003531,-0.001712,1.000000,-0.051263,-0.015438,0.022411,-0.019574,-0.007148
Cabin_U,0.000208,-0.316912,NaN,-0.271918,0.009064,-0.036806,-0.507197,-0.258257,0.142369,0.137351,...,-0.353822,-0.333381,-0.236733,-0.114803,-0.051263,1.000000,-0.014155,0.175812,-0.211367,0.056438
FamilySize,-0.031437,0.016639,NaN,-0.196996,0.861952,0.792296,0.226465,-0.036553,-0.087190,0.087771,...,-0.025313,-0.017285,0.005525,0.035835,-0.015438,-0.014155,1.000000,-0.688864,0.302640,0.801623
family_Single,0.028546,-0.203367,NaN,0.116675,-0.591077,-0.549022,-0.274826,-0.107874,0.127214,0.014246,...,-0.074310,-0.042535,0.004055,-0.076397,0.022411,0.175812,-0.688864,1.000000,-0.873398,-0.318944
family_Small,0.002975,0.279855,NaN,-0.038189,0.253590,0.248532,0.197281,0.159594,-0.122491,-0.062909,...,0.102432,0.068007,0.012756,0.087471,-0.019574,-0.211367,0.302640,-0.873398,1.000000,-0.183007
family_Large,-0.063415,-0.125147,NaN,-0.161210,0.699681,0.624627,0.170853,-0.092825,-0.018423,0.093671,...,-0.049336,-0.046485,-0.033009,-0.016008,-0.007148,0.056438,0.801623,-0.318944,-0.183007,1.000000

In [49]:
corrDf['Survived'].sort_values(ascending=False)

Survived         1.000000
Mrs              0.344935
Miss             0.332795
Pclass_1         0.285904
family_Small     0.279855
Fare             0.257307
Cabin_B          0.175095
Embarked_C       0.168240
Cabin_D          0.150716
Cabin_E          0.145321
Cabin_C          0.114652
Pclass_2         0.093349
Master           0.085221
Parch            0.081629
Cabin_F          0.057935
Royalty          0.050561
Cabin_A          0.022287
FamilySize       0.016639
Cabin_G          0.016040
Embarked_Q       0.003650
PassengerId     -0.005007
Cabin_T         -0.026456
Officer         -0.031316
SibSp           -0.035322
Age             -0.070323
family_Large    -0.125147
Embarked_S      -0.149683
family_Single   -0.203367
Cabin_U         -0.316912
Pclass_3        -0.322308
Mr              -0.549199
Sex                   NaN
Name: Survived, dtype: float64

In [50]:
full_x=pd.concat([titleDf,
                 pclassDf,
                 familyDf,
                 full['Fare'],
                 cabinDf,
                 embarkedDF,
                 full['Sex']],axis=1)
full_x.head()

,Master,Miss,Mr,Mrs,Officer,Royalty,Pclass_1,Pclass_2,Pclass_3,FamilySize,...,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U,Embarked_C,Embarked_Q,Embarked_S,Sex
0,0,0,1,0,0,0,0,0,1,2,...,0,0,0,0,0,1,0,0,1,NaN
1,0,0,0,1,0,0,1,0,0,2,...,0,0,0,0,0,0,1,0,0,NaN
2,0,1,0,0,0,0,0,0,1,1,...,0,0,0,0,0,1,0,0,1,NaN
3,0,0,0,1,0,0,1,0,0,2,...,0,0,0,0,0,0,0,0,1,NaN
4,0,0,1,0,0,0,0,0,1,1,...,0,0,0,0,0,1,0,0,1,NaN

In [51]:
import matplotlib.pyplot as plt
sourceRow=891
visualizedDf=full.loc[0:sourceRow-1,:]
visualizedDf.head()

,PassengerId,Survived,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked_C,Embarked_Q,...,Cabin_D,Cabin_E,Cabin_F,Cabin_G,Cabin_T,Cabin_U,FamilySize,family_Single,family_Small,family_Large
0,1,0.0,NaN,22.0,1,0,A/5 21171,7.2500,0,0,...,0,0,0,0,0,1,2,0,1,0
1,2,1.0,NaN,38.0,1,0,PC 17599,71.2833,1,0,...,0,0,0,0,0,0,2,0,1,0
2,3,1.0,NaN,26.0,0,0,STON/O2. 3101282,7.9250,0,0,...,0,0,0,0,0,1,1,1,0,0
3,4,1.0,NaN,35.0,1,0,113803,53.1000,0,0,...,0,0,0,0,0,0,2,0,1,0
4,5,0.0,NaN,35.0,0,0,373450,8.0500,0,0,...,0,0,0,0,0,1,1,1,0,0

In [52]:
#æ€§åˆ«ä¸Žå­˜æ´»äººæ•°çš„å…³ç³»
survived_m= visualizedDf.loc[visualizedDf['Sex']==1,'Survived'].value_counts()
survived_f= visualizedDf.loc[visualizedDf['Sex']==0,'Survived'].value_counts()
sexDf=pd.DataFrame({'male':survived_m,'female':survived_f})
sexDf

Empty DataFrame
Columns: [male, female]
Index: []

In [53]:
sexDf.T

Empty DataFrame
Columns: []
Index: [male, female]

In [46]:
sexDf.T.plot(kind='bar',stacked=True,color=['blue','red'])
plt.xlabel('sex')
plt.ylabel('count')
plt.title('sex vs count')
plt.legend(labels=['death','survived'])
plt.show()

TypeError: no numeric data to plot

In [ ]:
survived_Officer= visualizedDf.loc[visualizedDf['Officer']==1,
                                   'Survived'].value_counts()
survived_Royalty= visualizedDf.loc[visualizedDf['Royalty']==1,
                                   'Survived'].value_counts()
survived_Mr= visualizedDf.loc[visualizedDf['Mr']==1,
                                   'Survived'].value_counts()
survived_Mrs= visualizedDf.loc[visualizedDf['Mrs']==1,
                                   'Survived'].value_counts()
survived_Miss= visualizedDf.loc[visualizedDf['Miss']==1,
                                   'Survived'].value_counts()
survived_Master= visualizedDf.loc[visualizedDf['Master']==1,
                                   'Survived'].value_counts()
statusDf=pd.DataFrame({'Officer':survived_Officer,
                      'Royalty':survived_Royalty,
                      'Mr':survived_Mr,
                      'Mrs':survived_Mrs,
                      'Miss':survived_Miss,
                      'Master':survived_Master
})

In [ ]:
plt.figure(figsize=(12,4))
plt.figure()

statusDf.T.plot(kind='bar',stacked=True,color=['green','red'])
plt.xlabel('title')
plt.ylabel('count')
plt.title('title vs count')
plt.legend(labels=['death','survived'],loc="upper left")
plt.show()

In [ ]:
#å®¢èˆ±ç­‰çº§ä¸Žå­˜æ´»çš„å…³ç³»
survived_Pclass_1= visualizedDf.loc[visualizedDf['Pclass_1']==1,
                                   'Survived'].value_counts()
survived_Pclass_2= visualizedDf.loc[visualizedDf['Pclass_2']==1,
                                   'Survived'].value_counts()
survived_Pclass_3= visualizedDf.loc[visualizedDf['Pclass_3']==1,
                                   'Survived'].value_counts()
pclassDf=pd.DataFrame({'Pclass_1':survived_Pclass_1,
                      'Pclass_2':survived_Pclass_2,
                      'Pclass_3':survived_Pclass_3
})
plt.figure(figsize=(12,4))
plt.figure()

pclassDf.T.plot(kind='bar',stacked=True,color=['green','red'])
plt.xlabel('pclass')
plt.ylabel('count')
plt.title('pclass vs count')
plt.legend(labels=['death','survived'],loc="upper left")
plt.show()

In [ ]:
#å®¶åº­è§„æ¨¡ä¸Žå­˜æ´»çš„å…³ç³»
survived_family_Single= visualizedDf.loc[visualizedDf['family_Single']==1,
                                   'Survived'].value_counts()
survived_family_Small= visualizedDf.loc[visualizedDf['family_Small']==1,
                                   'Survived'].value_counts()
survived_family_Large= visualizedDf.loc[visualizedDf['family_Large']==1,
                                   'Survived'].value_counts()
familyDf=pd.DataFrame({'family_Single':survived_family_Single,
                      'family_Small':survived_family_Small,
                      'family_Large':survived_family_Large
})
plt.figure(figsize=(12,4))
plt.figure()

familyDf.T.plot(kind='bar',stacked=True,color=['green','red'])
plt.xlabel('family_size')
plt.ylabel('count')
plt.title('family_size vs count')
plt.legend(labels=['death','survived'],loc="upper right")
plt.show()

In [ ]:
#ç™»å½•æ¸¯å£ä¸Žå­˜æ´»çŽ‡çš„å…³ç³»
survived_C= visualizedDf.loc[visualizedDf['Embarked_C']==1,
                                   'Survived'].value_counts()
survived_Q= visualizedDf.loc[visualizedDf['Embarked_Q']==1,
                                   'Survived'].value_counts()
survived_S= visualizedDf.loc[visualizedDf['Embarked_S']==1,
                                   'Survived'].value_counts()
embarked_Df=pd.DataFrame({'Embarked_C':survived_C,
                      'Embarked_Q':survived_Q,
                      'Embarked_S':survived_S
})
plt.figure(figsize=(12,4))
plt.figure()

embarked_Df.T.plot(kind='bar',stacked=True,color=['green','red'])
plt.xlabel('embarked')
plt.ylabel('count')
plt.title('embarked vs count')
plt.legend(labels=['death','survived'],loc="upper left")
plt.show()

In [ ]:
#æž„å»ºæœºå™¨å­¦ä¹ æ¨¡åž‹
sourceRow=891
souce_X=full_x.loc[0:sourceRow-1,:]
souce_Y=full.loc[0:sourceRow-1,'Survived']
#é¢„æµ‹æ•°æ®é›†ï¼Œç‰¹å¾
pre_X=full_x.loc[sourceRow:,:]
souce_X.shape

In [ ]:
pre_X.shape

In [ ]:
from sklearn.model_selection import train_test_split
train_X,test_X,train_y,test_y=train_test_split(souce_X,
                                               souce_Y,
                                               train_size=0.8)
souce_X.head()

In [ ]:
souce_Y.head()

In [ ]:
#é€‰æ‹©æœºå™¨å­¦ä¹ ç®—æ³•
from sklearn.linear_model import LogisticRegression
model=LogisticRegression()
model.fit(train_X,train_y)

In [ ]:
model.score(test_X,test_y)